node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999974752427e-07
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.1415927410125732
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 15
          }
        }
        string_val: "./dataset/savee/bin/Training Set/SNeu/10.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/07.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/08.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/04.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/05.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/12.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/01.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/14.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/11.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/03.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/09.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/06.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/13.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/15.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/02.bin"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Size"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 15
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater"
  op: "Greater"
  input: "InputPipline/input_producer/Size"
  input: "InputPipline/input_producer/Greater/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert/data_0"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert"
  op: "Assert"
  input: "InputPipline/input_producer/Greater"
  input: "InputPipline/input_producer/Assert/Assert/data_0"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "InputPipline/input_producer/Identity"
  op: "Identity"
  input: "InputPipline/input_producer/Const"
  input: "^InputPipline/input_producer/Assert/Assert"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "InputPipline/input_producer/Identity"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs"
  op: "VariableV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/Assign"
  op: "Assign"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  input: "InputPipline/input_producer/limit_epochs/Const"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/read"
  op: "Identity"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/CountUpTo"
  op: "CountUpTo"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "limit"
    value {
      i: 1
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs"
  op: "Identity"
  input: "InputPipline/input_producer/RandomShuffle"
  input: "^InputPipline/input_producer/limit_epochs/CountUpTo"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer"
  op: "FIFOQueueV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "InputPipline/input_producer"
  input: "InputPipline/input_producer/limit_epochs"
  device: "/device:CPU:*"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close_1"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Size"
  op: "QueueSizeV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/ToFloat"
  op: "Cast"
  input: "InputPipline/input_producer/input_producer_Size"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul"
  op: "Mul"
  input: "InputPipline/input_producer/ToFloat"
  input: "InputPipline/input_producer/mul/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full/tags"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "InputPipline/input_producer/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full"
  op: "ScalarSummary"
  input: "InputPipline/input_producer/fraction_of_32_full/tags"
  input: "InputPipline/input_producer/mul"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/WholeFileReaderV2"
  op: "WholeFileReaderV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/ReaderReadV2"
  op: "ReaderReadV2"
  input: "InputPipline/WholeFileReaderV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/DecodeRaw"
  op: "DecodeRaw"
  input: "InputPipline/ReaderReadV2:1"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "InputPipline/Reshape/shape"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/Reshape"
  op: "Reshape"
  input: "InputPipline/DecodeRaw"
  input: "InputPipline/Reshape/shape"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1029
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice/stack"
  input: "InputPipline/strided_slice/stack_1"
  input: "InputPipline/strided_slice/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_1/stack"
  input: "InputPipline/strided_slice_1/stack_1"
  input: "InputPipline/strided_slice_1/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_2/stack"
  input: "InputPipline/strided_slice_2/stack_1"
  input: "InputPipline/strided_slice_2/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_3/stack"
  input: "InputPipline/strided_slice_3/stack_1"
  input: "InputPipline/strided_slice_3/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_4/stack"
  input: "InputPipline/strided_slice_4/stack_1"
  input: "InputPipline/strided_slice_4/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/Cast"
  op: "Cast"
  input: "InputPipline/strided_slice_4"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "sub/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "\037\312\207\300\021\310\207\300\305\266\207\300%\234\207\300\017\205\207\300K\255\207\300\222Y\210\300W\207\211\300\307\215\214\300\371\031\220\300]q\224\3007\031\231\300\231\375\233\300*d\235\300h\371\234\300g0\234\300\216w\233\300\226/\233\300z\330\232\300\257\207\233\300\225\336\234\300V\311\236\300\3623\241\300\373Y\243\300\322r\245\300S\272\247\300\315l\252\3008P\255\300\212\345\260\300\253B\264\300\372^\267\300\205\205\273\300\243\372\277\300\311_\305\300\343n\312\300\304\230\317\300\246\231\324\300\016o\331\300n}\335\300w\311\340\300\027\010\343\300\336\026\345\300se\346\300\274\337\347\300\020i\350\300\006\311\351\300\340@\353\300\302\341\354\300\2271\357\300e\306\361\300\223\272\364\300\325\000\370\300\213\227\372\300\272\345\374\300B\325\376\300\313\014\000\301\022\351\000\301\024\230\001\301}a\002\301]\305\002\301sE\003\301s\330\003\301\337b\004\301\035\020\005\3010j\005\3015h\005\301j0\005\301\340\245\004\301\256\371\003\301\325\205\003\301\334\032\003\301\232\263\002\301\374A\002\301\301.\002\301\356\353\001\301*\321\001\301\325q\001\301f\273\000\301\363i\000\301H\t\000\301m\315\377\300F\313\377\300\253\024\000\301\305.\000\301\342\212\000\301\205\231\000\301\304\243\000\301\327\203\000\301Ah\000\301\2659\000\301!:\000\301\035 \000\301UR\000\301\365u\000\301a\240\000\301\354\330\000\301X\"\001\301\315\236\001\301\010\343\001\301\307\020\002\301\222\271\002\301\205D\003\301c\032\004\301\364\342\004\301&U\005\301\212\361\005\301;\000\006\301\020,\006\301\225\276\006\301y\351\006\301_\"\007\301\nf\007\301a\336\007\301YP\010\301\177\241\010\301\321\023\t\301\242e\t\301%(\n\301\247e\n\301]\241\n\301s\036\013\301a]\013\301\334\250\013\301j-\014\301\331\307\014\301\020P\r\301\362\035\016\301\254\334\016\301F\247\017\301M\217\020\301g\257\021\301l\245\022\301\267\377\023\301\215\002\025\301\303?\026\301\353\315\027\301\005\332\030\301\215\n\032\301\320a\033\301\032\256\034\301S\327\035\301\344(\037\301cp \301\337\212!\301\345\266\"\301#\177#\301\263L$\301|-%\301;\270%\301\005\034&\301\234N&\301\234\262&\301\322\005\'\301&\017\'\301C \'\301P\314&\301\251\316&\301\277\244&\301\207\260&\301?\250&\301\020\243&\301\037\334&\301\272 \'\301\320\375&\301g\334&\301\032\377&\301a\"\'\301\277L\'\301\033n\'\301\215\317\'\301X\000(\301bO(\301h\202(\301\013\237(\301\r\321(\301[\267(\301@\354(\301\374\004)\301\255-)\301\362\204)\301H\303)\301{\342)\301~\377)\301\r\276)\301\327\245)\301\\:)\301\3251)\301\254\006)\301\250 )\301U\350(\301u\324(\301e\273(\301e\332(\301\230\267(\301\356\222(\301\203\002(\301\025g\'\301\327\315&\301B\234&\301>:&\301\217\340%\301xg%\301\0350%\301N\034%\301\244\022%\301j\246%\301\322\010&\301\376\r&\301\230\266%\301\324u%\301\317U%\301\010\202%\301\323\223%\301\236\263%\301y\327%\301\372\342%\301\r\363%\301\036\351%\301\375\311%\301\371\335%\301\000\021&\301\244i&\301\305\214&\301\302\332&\301J\025\'\301 [\'\301\t\260\'\301\326\327\'\301=\n(\301\255\375\'\301\264\353\'\301\022\264\'\301\204h\'\301\367t\'\301\250Q\'\301\263<\'\301\314\342&\301\306a&\301r\363%\301\234\260%\301#\027%\301m\316$\301d^$\301\014\272#\301\017y#\301\3636#\301\254\350\"\301r\263\"\301\336\227\"\301\374S\"\301q\000\"\301\310\273!\301\321f!\301VS!\301=\033!\301Q\366 \301\241\302 \301\232` \301\371O \301;\013 \301\324\277\037\301Go\037\301go\037\301yH\037\301\337<\037\301i\311\036\301\250\024\037\301\342+\037\301\3271\037\301#|\037\301i\226\037\301\346\365\037\301\360\021 \301\240\021 \301\204% \301)N \301r\231 \3019\223 \301&\304 \301k\366 \301\035\340 \301l\307 \301\032\230 \301\270I \301\213  \301h\364\037\301\315\006 \301\357\344\037\301\263\034 \3015\\ \301\366\240 \301\345\215 \301[\260 \301_\350 \301\327\024!\301\337\377 \301\2501!\301g\263!\301W\025\"\301Zs\"\301\037\272\"\301;_#\301\355\373#\301\276k$\301#\314$\301\3152%\301B\310%\301\236R&\301\034\267&\301h%\'\301\037_\'\301\001\265\'\301\204)(\301\310B(\301\267\277(\301\303])\301G\302)\301\320(*\301\023`*\301>\251*\301\333\027+\301\352Y+\301w\212+\301\267\312+\301\353\007,\301q(,\301\276(,\301\017:,\301\366\364+\301\007?,\301QK,\301\302Q,\301!o,\301A\220,\301d\372,\301\377e-\301h\227-\301\232\001.\301=/.\301#b.\301?\307.\301,%/\301\325\220/\301\300\323/\301\032\0350\301\315\2120\301;\3220\301\263X1\301i\2311\301\217\3721\301\357G2\301\367\2442\301\234\3362\301aQ3\301M\2153\301\\\3513\301\270D4\301\370\2254\301T\2674\301\02675\301^C5\301\317b5\301\006\2175\301/\3365\301\234!6\301ny6\301P\3056\301T\0327\301O\2637\301\237Q8\301q\3638\301\356\2039\301\320\3329\301\273\3439\301F\3419\301\213\3579\301#\3119\301N\3369\301H\3459\301\350\3529\301WC:\301k\207:\301T\364:\301vF;\301\311\256;\301e\350;\301\237b<\301-\266<\301\374\t=\301\300V=\301\013\177=\301\322O=\301\263==\301H\026=\301\257~<\3018\360;\301m\263;\301\3606;\301\352\376:\301p\032;\301\'#;\301\212:;\301\213u;\301\027\264;\301}\000<\301\357\213<\301 \000=\301\366~=\301\\\350=\301\226\037>\301\311R>\301\374X>\301yi>\301/\207>\301r\230>\301n\355>\301\230\024?\3018\034?\301CL?\301\246M?\301\242T?\301\236|?\301\226\252?\301\303\320?\301cR@\301u\232@\301\330\306@\301\351\374@\301\2549A\301b\234A\301\273\365A\3013AB\301\245JB\301\244\202B\301\033\244B\301U\320B\301\007\307B\301\017\300B\301\010\261B\301j|B\301}\214B\301\322\200B\301;\264B\301\225\304B\301\254\205B\301FaB\301\306jB\301-pB\301\301OB\301\362NB\301xNB\301\3536B\301\327!B\3018/B\301\366\027B\301\226\027B\3015\004B\301\316\352A\301i\311A\301\025\313A\301y\260A\301\357{A\301\025\213A\3015mA\301\020uA\301 dA\301DXA\3011[A\301\244@A\301\276=A\301r<A\301+kA\301+@A\3018*A\301\342)A\301Z1A\301\177)A\301\2776A\301\354AA\301L=A\301\224aA\301\004sA\301\373\234A\301\323\236A\301\006\320A\301\217\026B\301\001dB\301r\231B\301\221\360B\301#MC\301\203jC\301\004\322C\301m/D\301@\227D\301N\353D\301;\026E\301p8E\301\315<E\301\211\210E\301\315\254E\301j\272E\301\r\315E\301.\343E\301\277\331E\301#\304E\301\027\310E\301\025\037F\301\004\344F\301\274\371G\301m\220I\301\214\360J\301\217\023L\301\361gL\301"
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "InputPipline/strided_slice"
  input: "sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "truediv/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "\353\373S@4\003U@\351/W@\353\252Y@TT[@\266\231Z@\371\252X@:\030X@\031\352Z@\227\272a@Aep@\014\020~@\t\316\202@m)\203@\344\372\200@\244\216\201@zl\202@\261\306\202@\254\237\201@\024\"\202@\310U\204@L\340\205@i\260\207@\332X\210@\213#\211@\025\203\212@hL\215@\\g\220@-,\224@\343\331\226@s\274\227@\033\315\231@\257\'\235@\313\240\241@@\003\245@v,\250@G\010\253@y\265\255@\331I\257@\343\327\260@\374\204\262@\300\342\263@;<\264@\230f\264@\003\001\263@eu\262@\222B\262@\004\006\262@\260\322\262@\235\203\264@\242-\267@\310\243\271@8~\273@MA\275@S\203\276@\005\222\277@\321\272\301@NY\303@\003\217\305@\341i\306@\017U\307@)g\310@\242\334\310@\'\036\311@\035\277\310@\200*\310@8\334\307@\277\363\307@\340A\310@\030\226\311@6\263\313@\021O\315@:5\316@M\235\320@|\237\321@A\337\323@\360\203\324@\003\223\323@\007\215\322@\272\327\320@\311<\320@\313d\317@\273\032\317@\010\355\315@\nP\315@\002\215\313@\\:\312@m\023\311@-\264\307@\213\317\306@\214\200\306@\006^\306@J\337\306@\017\303\306@\257\252\306@Q\370\306@\354G\307@C\225\307@f\333\307@2R\310@\275q\311@\255|\312@\251\344\313@NJ\315@\'\250\316@\016\244\320@L\361\320@\361\006\322@\232\377\323@\336\203\325@*\377\326@}i\330@\3267\332@\266\300\333@|%\335@\250\222\336@\313\340\337@\007\277\341@\374\271\342@\036\\\343@\3060\344@\177Q\344@\372q\344@T\230\344@\314\001\345@^\323\344@\314/\345@\304C\345@H\345\344@\005\316\344@\230d\345@\351I\346@\034\313\347@\202\322\350@\372d\352@`\275\354@~\353\355@\301m\357@\305r\361@\322z\363@\331\217\365@\230\265\367@3n\372@\2427\375@R\370\377@\361\031\001A\252\026\002A\250W\003A\255\024\004A}\254\004A\2335\005A\t\355\005A\260a\006A\364 \006A\377\007\006A\347\227\005A\206\234\005Ac^\005A\320\222\005Ag\316\005A*\340\005AW\032\006A\007\223\006A\371\210\006A]\223\006A\301\330\006AM2\007A!r\007A\302\242\007Am\037\010AW\033\010A\365u\010As\306\010A5\027\tA\315v\tA\005\265\tAb\007\nA\3209\nA{e\nA`\275\nA<>\013Ae\276\013A\254D\014AYe\014A]\307\014A\364\340\014A8l\rA\307\343\rA\023^\016Aj\200\016A-\212\016A\263\277\016A1r\017AD\272\017AP\024\020A{\230\017Aw\017\017A#a\016A\030\025\016AZ-\rAoX\014A\364g\013A\352\222\nA\037\333\tA\005\233\tA\344\020\nA\345H\nAv=\nA\234\236\tA\227m\tA>l\tA\205\273\tA\223\n\nA\227C\nAf|\nA\243\233\nA\230\213\nA\010\235\nA#H\nA\333U\nA\256W\nA\000\217\nA\351\215\nA\210\300\nA\336\205\nA\320x\nA\221Q\nA;\371\tA\326\334\tA\370\317\tA\376\210\tA?\006\tA\202\207\010A\360,\010A\335\277\007A\307k\007Aa\331\006A\216C\006A\336\336\005A/\217\005A\235\266\004A\372\\\004A\n\342\003A\237x\003A\342S\003A\332:\003A\3214\003A\021,\003A\240^\003A\270S\003A\357O\003A\014p\003A\271V\003A\263\225\003A\332\337\003A\314V\004AR\272\004A\271\214\004A\300\322\004A*\243\004Aq\233\004Ad_\004AzB\004A\n\"\004A\235!\004A\227\322\003A\254*\004A*U\004A\273j\004A:\223\004A\326\227\004A\010\307\004A@\324\004AU\252\004A\306\177\004A\354p\004A\216v\004A\304u\004AMw\004A-}\004A\330B\004A\304\021\004A;\314\003A0L\003A\273\330\002A\036u\002A5N\002A\027\r\002A\017\341\001A\260\221\001A\316I\001A\342y\000A\264\t\000A\316X\377@w>\376@\337Y\374@\227\213\373@;\231\373@%3\373@[\356\372@N\353\372@\r\216\373@\306\333\373@\200N\374@\225M\374@\250~\374@<\236\374@\213\354\374@\356\236\374@\022\241\374@\2660\374@\336\276\373@m\221\373@\340\303\372@\353|\372@\365\370\371@j\317\371@\330f\371@j\312\370@`E\370@\017\031\370@\315\017\370@M\005\370@V-\370@PV\370@\306\237\367@\267p\367@\230\025\367@\027P\366@\227\245\366@B\224\366@\344\321\365@9?\365@]\374\364@\035)\365@\035\331\365@=\323\365@/\356\365@\"&\366@\263\266\366@\304\030\367@\035\207\367@\312\t\370@~ \370@\263\223\370@\363I\371@r\346\371@\344\364\372@\313;\373@~G\373@{K\373@\274\033\373@\232\031\373@\203\205\373@\336\355\372@k\t\373@\303\266\372@A\371\372@a\372\372@\275e\373@\027 \373@m\346\372@\365|\372@\254\204\372@0\300\372@\305\232\372@j\317\372@x\362\372@U\211\373@\202\244\374@\375:\376@\314\310\377@\342\007\000A\016>\376@\204m\374@\037\267\372@\2201\371@F\356\367@\255\025\367@~\257\365@\323\265\364@\217\353\363@2\225\363@\r\346\362@]\007\362@\013\t\361@\321\265\360@C6\360@\034\357\357@\276\356\357@1.\357@h\335\355@.\306\354@z\014\354@\312\353\351@;\256\347@\004\333\345@rm\343@\214\230\341@|c\340@\315\003\337@\315\375\335@x\203\335@j9\335@\247\314\334@\371\036\335@\317w\335@F\274\335@b\376\335@\244;\336@\010l\336@\200\005\336@G\343\335@\367\347\335@/\316\335@\246?\336@y\207\336@0\252\336@\326\375\336@\261\375\336@\0014\337@\314z\337@y\267\337@\372\021\340@\235\341\340@\306R\341@A\272\341@\303y\342@\237?\343@\277\335\343@\217\257\344@\337U\345@]~\345@\037\326\345@\t\372\345@xz\346@\275\205\346@Q\226\346@TJ\346@>\366\345@\010\031\346@=$\346@Iz\346@Y\316\346@\366@\346@4\350\345@\223\004\346@\211\022\346@\215\310\345@>\335\345@!\370\345@Z\324\345@\302\251\345@\337\262\345@\336\303\345@c\247\345@xn\345@/D\345@\021\317\344@\223\321\344@,\217\344@\300X\344@^\312\344@2\253\344@A\244\344@\3614\344@\265a\344@\342\210\344@ld\344@=H\344@(]\344@~\324\344@\324\212\344@\371\306\344@\333\270\344@\247\225\344@\014v\344@\342\224\344@:9\344@W<\344@[K\344@MS\344@5i\344@=W\344@\004\200\344@&\375\344@\233l\345@\253\224\345@\226\001\346@\177\035\346@7\323\345@\377>\346@\275\330\346@\3322\347@01\347@\031\r\347@\004\332\346@\251\306\346@\314=\347@\325n\347@K\320\347@\227\322\347@\246\036\350@\216:\350@cv\350@:\353\350@\203\332\351@\276\302\353@\277Z\356@\303\033\362@=G\365@;?\370@o?\371@"
      }
    }
  }
}
node {
  name: "truediv"
  op: "RealDiv"
  input: "sub"
  input: "truediv/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum"
  op: "Minimum"
  input: "truediv"
  input: "clip_by_value/Minimum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "clip_by_value"
  op: "Maximum"
  input: "clip_by_value/Minimum"
  input: "clip_by_value/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "clip_by_value"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "sub_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "sub_1"
  op: "Sub"
  input: "mul"
  input: "sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims"
  op: "ExpandDims"
  input: "sub_1"
  input: "NH_to_NHWC/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1"
  op: "ExpandDims"
  input: "NH_to_NHWC/ExpandDims"
  input: "NH_to_NHWC/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Shape"
  op: "Shape"
  input: "NH_to_NHWC/ExpandDims_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice"
  op: "StridedSlice"
  input: "Shape"
  input: "strided_slice/stack"
  input: "strided_slice/stack_1"
  input: "strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "ones/shape"
  op: "Pack"
  input: "strided_slice"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "ones/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "ones"
  op: "Fill"
  input: "ones/shape"
  input: "ones/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "mul_1"
  op: "Mul"
  input: "Placeholder"
  input: "ones"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "y_embedding/y_emb/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@y_embedding/y_emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
