node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999974752427e-07
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.1415927410125732
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 54
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 54
          }
        }
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200013.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200003.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200004.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200023.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200025.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200044.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200034.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200035.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200048.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200036.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200029.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200047.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200032.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200024.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200019.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200043.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200011.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200021.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200015.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200012.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200053.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200030.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200017.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200001.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200028.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200018.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200027.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200042.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200007.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200051.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200008.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200045.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200010.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200046.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200050.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200026.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200038.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200037.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200020.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200016.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200002.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200005.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200039.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200040.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200049.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200006.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200052.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200041.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200054.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200014.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200009.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200031.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200033.bin"
        string_val: "./dataset/vcc2016/bin/Testing Set/SF1/200022.bin"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Size"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 54
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater"
  op: "Greater"
  input: "InputPipline/input_producer/Size"
  input: "InputPipline/input_producer/Greater/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert/data_0"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert"
  op: "Assert"
  input: "InputPipline/input_producer/Greater"
  input: "InputPipline/input_producer/Assert/Assert/data_0"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "InputPipline/input_producer/Identity"
  op: "Identity"
  input: "InputPipline/input_producer/Const"
  input: "^InputPipline/input_producer/Assert/Assert"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 54
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "InputPipline/input_producer/Identity"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 54
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs"
  op: "VariableV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/Assign"
  op: "Assign"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  input: "InputPipline/input_producer/limit_epochs/Const"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/read"
  op: "Identity"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/CountUpTo"
  op: "CountUpTo"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "limit"
    value {
      i: 1
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs"
  op: "Identity"
  input: "InputPipline/input_producer/RandomShuffle"
  input: "^InputPipline/input_producer/limit_epochs/CountUpTo"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 54
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer"
  op: "FIFOQueueV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "InputPipline/input_producer"
  input: "InputPipline/input_producer/limit_epochs"
  device: "/device:CPU:*"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close_1"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Size"
  op: "QueueSizeV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/ToFloat"
  op: "Cast"
  input: "InputPipline/input_producer/input_producer_Size"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul"
  op: "Mul"
  input: "InputPipline/input_producer/ToFloat"
  input: "InputPipline/input_producer/mul/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full/tags"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "InputPipline/input_producer/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full"
  op: "ScalarSummary"
  input: "InputPipline/input_producer/fraction_of_32_full/tags"
  input: "InputPipline/input_producer/mul"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/WholeFileReaderV2"
  op: "WholeFileReaderV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/ReaderReadV2"
  op: "ReaderReadV2"
  input: "InputPipline/WholeFileReaderV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/DecodeRaw"
  op: "DecodeRaw"
  input: "InputPipline/ReaderReadV2:1"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "InputPipline/Reshape/shape"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/Reshape"
  op: "Reshape"
  input: "InputPipline/DecodeRaw"
  input: "InputPipline/Reshape/shape"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1029
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice/stack"
  input: "InputPipline/strided_slice/stack_1"
  input: "InputPipline/strided_slice/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_1/stack"
  input: "InputPipline/strided_slice_1/stack_1"
  input: "InputPipline/strided_slice_1/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_2/stack"
  input: "InputPipline/strided_slice_2/stack_1"
  input: "InputPipline/strided_slice_2/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_3/stack"
  input: "InputPipline/strided_slice_3/stack_1"
  input: "InputPipline/strided_slice_3/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_4/stack"
  input: "InputPipline/strided_slice_4/stack_1"
  input: "InputPipline/strided_slice_4/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/Cast"
  op: "Cast"
  input: "InputPipline/strided_slice_4"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "sub/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "\305w\267\300^x\267\300.|\267\300#\201\267\300\362\212\267\300(\217\267\300\323\216\267\300\264\226\267\300\233\226\267\300\315\234\267\300\321\243\267\300(\260\267\300u\300\267\300\300\257\267\300(\223\267\300\014\207\267\300\264s\267\300B`\267\300dX\267\300\314c\267\300\'W\267\300:T\267\300\222m\267\300\245k\267\300w\275\267\300x\364\267\300\236Z\270\300n\014\271\300o\317\271\300\223\256\272\300\345u\273\300\243j\274\300B\231\275\300k\244\276\300s\255\277\300C\014\301\300\365\343\302\300D\262\304\300$\225\306\300m\230\310\300w\306\312\300\266\327\314\300\206\314\316\300R\204\320\300$\245\321\300\030\262\322\300y\333\323\300\372\327\324\300%\304\325\300Z\220\326\300\201%\327\300$\306\327\300\334I\330\300\353-\331\300\374?\332\300\024&\333\300\023U\334\300M\200\335\300\315\275\336\3006\362\337\300&$\341\300\267:\342\300\020p\343\300\347\321\344\300\030\366\345\300\273p\347\300\267\354\350\300\re\352\300\242\320\353\300\267L\355\300\332x\356\300\334\321\357\300)\325\360\300T)\362\300+U\363\300\303\260\364\300\311\315\365\300\325\262\366\300b\337\367\300S\216\370\300\254\320\370\300 \000\371\300-\027\371\300\3735\371\300dj\371\300\343\210\371\300\223\265\371\300\316\031\372\300_\256\372\300\364~\373\300\r\'\374\300k\321\374\300\247]\375\300&\246\375\300\177\321\375\300\253\031\376\300\tk\376\3005\325\376\300D0\377\300\262\266\377\300\232-\000\301Lw\000\301\367\320\000\301\375\014\001\301\263A\001\301\240l\001\301\206\252\001\301\275\370\001\301y2\002\301\226m\002\301\240\270\002\3010\361\002\301\177$\003\301/Y\003\301^\177\003\301\037\350\003\301K1\004\301\257\214\004\301\032\327\004\301L\003\005\301\032.\005\301\037Q\005\301n|\005\301\000\221\005\301\251\256\005\301\304\312\005\301y\367\005\301d\001\006\301\347\372\005\301\266\376\005\301&\366\005\301@\013\006\301\024\'\006\301_\"\006\301#\025\006\301\266\"\006\301Q\'\006\301\372(\006\301r)\006\301\227*\006\301\206\'\006\301\241/\006\301\0252\006\301\0307\006\301!%\006\301P\034\006\301A\037\006\301\332-\006\3011>\006\301yH\006\301Zi\006\301\234r\006\301G\202\006\301a{\006\301\275\203\006\301M\221\006\301\341\235\006\301D\265\006\301H\327\006\301\230\364\006\301\317 \007\301\021A\007\301R]\007\301\003z\007\301\263\204\007\301\361\241\007\301&\306\007\301\021\351\007\301\273\003\010\301\037\033\010\301c:\010\301\275X\010\301\tu\010\301\345\220\010\301\370\244\010\301f\270\010\301\\\315\010\301\327\336\010\301\271\360\010\301\372\007\t\301%\025\t\301\373+\t\301\367C\t\301\234X\t\301\354p\t\301#\206\t\301i\243\t\301\211\272\t\301\007\331\t\301\352\366\t\301\t\021\n\301\2716\n\301\357V\n\301Bq\n\301\037\212\n\3012\257\n\301\307\302\n\301\361\326\n\301\320\370\n\301\355\017\013\301\257,\013\301mH\013\301\034n\013\301o\205\013\301\217\245\013\301Y\316\013\301\362\371\013\301!-\014\301\321S\014\301\353y\014\301\216\242\014\3013\326\014\301j\372\014\301H.\r\301=V\r\301,\226\r\301h\317\r\3017\005\016\301\330U\016\301\036\227\016\301\240\330\016\301\345\026\017\3013Y\017\301p\206\017\301G\272\017\301\346\355\017\301_\007\020\301\3402\020\301CX\020\301E~\020\301a\243\020\301\023\254\020\301\254\273\020\301A\323\020\301\020\354\020\301\007\370\020\301\244\023\021\301>-\021\301\206F\021\301\013T\021\301<`\021\301-t\021\301\352\177\021\301\002\216\021\301\325\240\021\301\212\251\021\301\323\262\021\301_\304\021\301\334\306\021\301?\327\021\301\350\322\021\301+\333\021\301v\327\021\301\362\323\021\301\334\331\021\301\377\337\021\301j\357\021\301j\355\021\301\330\370\021\301I\371\021\301p\355\021\301b\332\021\301\344\273\021\301\361\237\021\301v\210\021\301*}\021\301\032m\021\301G[\021\301\017e\021\301\266w\021\301\326y\021\301O\205\021\301\352\241\021\301\371\270\021\301f\333\021\301\246\344\021\301I\372\021\301Q\027\022\301d&\022\301\320=\022\301\003M\022\301\232s\022\301^\234\022\301\212\264\022\301\346\310\022\301\351\342\022\301\352\004\023\301#\035\023\301!A\023\301\310R\023\301\240n\023\301\303\216\023\301\200\244\023\301\261\255\023\301A\273\023\301\320\324\023\301\n\341\023\301p\342\023\301\257\355\023\301\252\001\024\3017\024\024\301\3558\024\301\266N\024\301\234\204\024\301\316\246\024\301\352\333\024\301\354\014\025\301\232:\025\301`_\025\301\020\203\025\301\241\267\025\301?\354\025\301d\026\026\301\243U\026\301\331\246\026\301\353\342\026\301OC\027\301\371\220\027\301)\334\027\301\3212\030\301\213\213\030\301\332\330\030\301\252%\031\301\363u\031\3014\307\031\301x\014\032\301\2140\032\301\014]\032\301\356\211\032\3015\262\032\301\263\345\032\301\"\027\033\301\265L\033\3011h\033\301S\214\033\301\305\236\033\301!\243\033\301m\231\033\301\242\204\033\3012\177\033\301\226i\033\301\206E\033\301\247\'\033\301p\024\033\301\235\004\033\301P\375\032\3012\352\032\301U\321\032\301\262\275\032\301\373\254\032\301\025\222\032\301\223\217\032\301\203\223\032\301\t\221\032\301\310\232\032\301o\240\032\301\205\246\032\301\r\262\032\301S\303\032\301/\342\032\301N\366\032\301Q\013\033\301\020\033\033\301\2109\033\301TI\033\301*^\033\301 k\033\301\360n\033\301\260r\033\301\337z\033\301\336\215\033\301\027\227\033\301\251\254\033\301\302\317\033\301U\000\034\301\010\031\034\301*3\034\301\226P\034\301\005i\034\301\211\200\034\301\354\252\034\301\237\324\034\301\016\003\035\301\331$\035\301\013E\035\301*g\035\301\335\221\035\301\003\272\035\301\213\334\035\301\006\375\035\301-\033\036\301\213C\036\301\024a\036\301\254\225\036\301v\272\036\301V\333\036\301@\374\036\301?\021\037\301\036%\037\301b)\037\301\266)\037\301\230\033\037\301o\006\037\301\274\355\036\301\336\334\036\301\200\300\036\301\027\241\036\301g\200\036\301Md\036\301\032@\036\301\252*\036\301\217\375\035\301\305\350\035\301\315\301\035\301\316\240\035\301Dz\035\301\342Y\035\301EA\035\301\3762\035\301\223,\035\301j6\035\301\2210\035\301hE\035\301\271D\035\301A@\035\301yE\035\301\376=\035\301zG\035\301aG\035\301\300A\035\301EC\035\301\371I\035\301KG\035\301FA\035\301`?\035\301\3141\035\301\333+\035\301\216-\035\301\260)\035\301\213\"\035\301\244 \035\301`\030\035\301\036\034\035\301T\031\035\301\221\r\035\301\212\363\034\301o\330\034\301\353\303\034\301\233\266\034\301\010\236\034\301\272\201\034\301\246x\034\301\232`\034\301WN\034\301\2564\034\301\233*\034\301\225\021\034\301\215\371\033\301\202\350\033\301;\352\033\301\235\370\033\3011\372\033\3016\367\033\3010\371\033\301\006\374\033\301\370\022\034\301\272\023\034\301F\034\034\301n\"\034\301\326\036\034\301E)\034\301\276,\034\301\260!\034\301\034,\034\301p*\034\301Y1\034\301\3676\034\301\232D\034\301\222Y\034\301\035t\034\301$\220\034\301i\252\034\301G\275\034\301z\315\034\301\370\337\034\301j\353\034\301\357\006\035\301\271\037\035\301\2305\035\301\237G\035\301_Y\035\301\320k\035\301\330\227\035\301\274\272\035\301\220\344\035\301\315\005\036\301\255 \036\301\257Z\036\301\250\233\036\301\275\321\036\301\264\017\037\301\'Z\037\301w\241\037\301,\014 \301\203o \301\\\317 \301\237O!\301\330\324!\301\177\204\"\301\353s#\301\343u$\301gA%\301\306\212%\301"
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "InputPipline/strided_slice"
  input: "sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "truediv/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "$\267\224@1\003\225@\014\314\225@\304\301\226@u\264\227@\2732\230@\312\255\227@#\034\226@\'\357\224@\330\007\224@H\277\223@LY\224@G\'\226@\006%\230@\000\233\231@u\317\232@\2473\233@B\256\232@*_\231@\331\321\227@\343(\226@\363\371\224@\353\301\224@\220\"\225@\332\243\225@<U\225@\241\327\224@M\016\225@\275\352\225@w\254\226@\\\274\226@\311\207\226@\343\006\227@\n\n\230@\023Z\231@\261\370\232@\321@\235@n\277\237@\262\027\242@\320)\244@\274\035\246@\001\370\247@Z\347\251@\200r\253@\217@\254@\020\316\254@\"\203\255@\217\335\255@\214\'\256@\253:\256@v\004\256@\210\274\255@\250$\255@\243\341\254@\r\300\254@\"\261\254@\362\364\254@(\215\255@\204s\256@\326e\257@ x\260@\313\205\261@\244\313\262@yK\264@\342\222\265@\251!\267@\345\270\270@\211I\272@\035\272\273@\\R\275@\256\240\276@\224$\300@\2128\301@\241x\302@\312\215\303@\007\306\304@\322\306\305@\377x\306@\025\177\307@\216\365\307@\206\373\307@G\365\307@\373\311\307@[\260\307@\323\214\307@\215[\307@;/\307@oL\307@o\200\307@\341\357\307@\321A\310@\241\227\310@\025\344\310@\205\351\310@A\341\310@\311\360\310@\030\020\311@\367P\311@qj\311@\342\262\311@c\034\312@d\202\312@\\\356\312@\2560\313@:`\313@\031\177\313@\031\276\313@J\033\314@\235a\314@\310\242\314@\231\352\314@\376\004\315@E\031\315@9%\315@R\025\315@{\241\315@\014\352\315@\314P\316@\374\247\316@\217\270\316@{\336\316@\210\341\316@\361\t\317@q\372\316@\236\014\317@\263\007\317@\020H\317@:E\317@\231,\317@\302!\317@\215\005\317@\375$\317@4V\317@AJ\317@\336,\317@\267<\317@\3406\317@L\033\317@\326\372\316@\333\323\316@\342\236\316@+c\316@\241\037\316@\033\344\315@\312Z\315@\007\363\314@\353\234\314@@v\314@\326M\314@M\026\314@\263\034\314@\377\377\313@H\004\314@\007\345\313@\233\360\313@\232\013\314@`+\314@Px\314@\305\324\314@m9\315@2\300\315@\200,\316@L\250\316@\202\016\317@\021^\317@\300\273\317@J\'\320@\353\211\320@\335\316\320@\013\004\321@\350E\321@\204t\321@p\247\321@6\305\321@b\310\321@\314\316\321@\021\314\321@\325\276\321@o\252\321@\206\243\321@j\230\321@\342\253\321@\225\277\321@\356\311\321@\232\335\321@\210\356\321@\212\037\322@\3322\322@\211Q\322@5s\322@\260\210\322@\260\304\322@\005\013\323@\267\'\323@\325C\323@\317\210\323@\264\260\323@\207\322\323@\240\'\324@\225c\324@\354\240\324@\346\316\324@j\037\325@\334W\325@\277\241\325@\210\355\325@\034M\326@\367\261\326@K\016\327@\027`\327@\003\317\327@\331P\330@`\262\330@\356<\331@\350\264\331@cG\332@\377\350\332@gq\333@)9\334@\177\345\334@t\210\335@\356=\336@a\357\336@`\200\337@N#\340@(\272\340@\217\013\341@\362\225\341@\351\001\342@tx\342@M\344\342@\236\026\343@\256H\343@\\\206\343@1\305\343@\350\346\343@\351\031\344@\301R\344@\232\204\344@s\245\344@p\304\344@\363\355\344@\314\372\344@\301\n\345@\355\030\345@\354\034\345@\250\034\345@\324-\345@\202\034\345@N*\345@\032\035\345@\270 \345@e\024\345@\024\013\345@\223\n\345@\355\016\345@y2\345@*4\345@vE\345@\215X\345@\211F\345@Q)\345@\272\362\344@\372\270\344@Z\230\344@\000\215\344@\334}\344@\tI\344@\237a\344@\253x\344@\233d\344@\355i\344@\242\223\344@(\237\344@W\307\344@\313\277\344@B\314\344@\367\341\344@\213\340\344@\234\350\344@\306\340\344@:\023\345@w3\345@\022;\345@5D\345@pO\345@\334n\345@`{\345@\320\254\345@+\313\345@n\001\346@k/\346@NR\346@\235U\346@7n\346@\226\220\346@!\244\346@\271\242\346@\200\277\346@p\334\346@\314\006\347@\360E\347@\256|\347@\254\351\347@\377$\350@\330\224\350@\362\364\350@\245L\351@\371\232\351@\267\337\351@\313R\352@\223\277\352@2\014\353@\217\226\353@\316C\354@I\267\354@[\204\355@Y0\356@\204\350\356@\221\252\357@%}\360@r \361@\335\272\361@(m\362@\234&\363@\316\312\363@e.\364@0\242\364@\260\026\365@\257\213\365@\311\022\366@\247\226\366@,\037\367@\342u\367@\301\326\367@\034\030\370@\3646\370@d.\370@M\021\370@J\023\370@\312\360\367@\320\260\367@\366\200\367@\rZ\367@3+\367@w\026\367@:\346\366@\003\260\366@\265{\366@\253I\366@\006\004\366@\273\360\365@\316\375\365@\341\346\365@\323\357\365@\376\347\365@\215\344\365@z\363\365@\322\022\366@\203M\366@\357{\366@Z\242\366@\355\320\366@N\017\367@\236\037\367@\365A\367@\361]\367@\343o\367@\306u\367@x\216\367@\210\313\367@\305\347\367@\022&\370@\025}\370@\217\347\370@V+\371@7y\371@\302\306\371@\016\r\372@MP\372@C\265\372@\261\035\373@\025\214\373@\304\325\373@\336\032\374@\233m\374@\013\331\374@\327A\375@\217\241\375@\361\347\375@I.\376@m}\376@\033\303\376@#+\377@:u\377@I\247\377@\374\333\377@7\370\377@+\005\000A\302\356\377@\201\320\377@\017\227\377@kS\377@\353\000\377@<\264\376@-T\376@b\351\375@Z\211\375@\2463\375@m\315\374@\254~\374@\020\006\374@\"\275\373@)Y\373@\374\374\372@\213\225\372@\222D\372@e\002\372@\235\337\371@\322\304\371@\257\330\371@O\275\371@b\365\371@h\352\371@Q\346\371@;\361\371@^\340\371@\241\372\371@\351\010\372@\335\007\372@\210\036\372@\2216\372@\014Q\372@\201X\372@{T\372@\212D\372@|E\372@\371\\\372@\204t\372@\313v\372@}\204\372@J\201\372@\335\230\372@~\235\372@\332\247\372@\021\220\372@\276_\372@\317O\372@\340K\372@w+\372@\200\007\372@\300\375\371@d\324\371@O\274\371@I\230\371@\334\226\371@0m\371@\236[\371@ZB\371@,=\371@\277Y\371@\345Y\371@}D\371@\366D\371@\262B\371@\\l\371@\221]\371@\267V\371@\355U\371@\224?\371@I9\371@\013.\371@D\372\370@,\354\370@\223\277\370@\372\226\370@\016v\370@\377Q\370@\213C\370@\312*\370@7&\370@\371\031\370@\253\373\367@L\321\367@:\237\367@Tm\367@v_\367@\2177\367@L\036\367@\352\375\366@\024\325\366@a\244\366@S\317\366@a\350\366@*$\367@vX\367@N~\367@`\370\367@\364\205\370@!\r\371@\342\234\371@\275X\372@\373\034\373@g*\374@\306\'\375@\177\035\376@\360Q\377@\361F\000A\217\017\001A\222\031\002A\r4\003Ay\017\004Ap_\004A"
      }
    }
  }
}
node {
  name: "truediv"
  op: "RealDiv"
  input: "sub"
  input: "truediv/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum"
  op: "Minimum"
  input: "truediv"
  input: "clip_by_value/Minimum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "clip_by_value"
  op: "Maximum"
  input: "clip_by_value/Minimum"
  input: "clip_by_value/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "clip_by_value"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "sub_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "sub_1"
  op: "Sub"
  input: "mul"
  input: "sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims"
  op: "ExpandDims"
  input: "sub_1"
  input: "NH_to_NHWC/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1"
  op: "ExpandDims"
  input: "NH_to_NHWC/ExpandDims"
  input: "NH_to_NHWC/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Shape"
  op: "Shape"
  input: "NH_to_NHWC/ExpandDims_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
