node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999974752427e-07
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.1415927410125732
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 15
          }
        }
        string_val: "./dataset/savee/bin/Training Set/SNeu/n07.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n04.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n02.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n11.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n10.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n01.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n05.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n09.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n12.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n15.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n03.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n06.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n14.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n08.bin"
        string_val: "./dataset/savee/bin/Training Set/SNeu/n13.bin"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Size"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 15
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Greater"
  op: "Greater"
  input: "InputPipline/input_producer/Size"
  input: "InputPipline/input_producer/Greater/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert/data_0"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/Assert/Assert"
  op: "Assert"
  input: "InputPipline/input_producer/Greater"
  input: "InputPipline/input_producer/Assert/Assert/data_0"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "InputPipline/input_producer/Identity"
  op: "Identity"
  input: "InputPipline/input_producer/Const"
  input: "^InputPipline/input_producer/Assert/Assert"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "InputPipline/input_producer/Identity"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/Const"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs"
  op: "VariableV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/Assign"
  op: "Assign"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  input: "InputPipline/input_producer/limit_epochs/Const"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/epochs/read"
  op: "Identity"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs/CountUpTo"
  op: "CountUpTo"
  input: "InputPipline/input_producer/limit_epochs/epochs"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@InputPipline/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "limit"
    value {
      i: 1
    }
  }
}
node {
  name: "InputPipline/input_producer/limit_epochs"
  op: "Identity"
  input: "InputPipline/input_producer/RandomShuffle"
  input: "^InputPipline/input_producer/limit_epochs/CountUpTo"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 15
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer"
  op: "FIFOQueueV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "InputPipline/input_producer"
  input: "InputPipline/input_producer/limit_epochs"
  device: "/device:CPU:*"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Close_1"
  op: "QueueCloseV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "InputPipline/input_producer/input_producer_Size"
  op: "QueueSizeV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/ToFloat"
  op: "Cast"
  input: "InputPipline/input_producer/input_producer_Size"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul/y"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/mul"
  op: "Mul"
  input: "InputPipline/input_producer/ToFloat"
  input: "InputPipline/input_producer/mul/y"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full/tags"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "InputPipline/input_producer/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "InputPipline/input_producer/fraction_of_32_full"
  op: "ScalarSummary"
  input: "InputPipline/input_producer/fraction_of_32_full/tags"
  input: "InputPipline/input_producer/mul"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/WholeFileReaderV2"
  op: "WholeFileReaderV2"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "InputPipline/ReaderReadV2"
  op: "ReaderReadV2"
  input: "InputPipline/WholeFileReaderV2"
  input: "InputPipline/input_producer"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "InputPipline/DecodeRaw"
  op: "DecodeRaw"
  input: "InputPipline/ReaderReadV2:1"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "InputPipline/Reshape/shape"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/Reshape"
  op: "Reshape"
  input: "InputPipline/DecodeRaw"
  input: "InputPipline/Reshape/shape"
  device: "/device:CPU:*"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1029
          }
        }
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice/stack"
  input: "InputPipline/strided_slice/stack_1"
  input: "InputPipline/strided_slice/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\002\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_1"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_1/stack"
  input: "InputPipline/strided_slice_1/stack_1"
  input: "InputPipline/strided_slice_1/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_2"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_2/stack"
  input: "InputPipline/strided_slice_2/stack_1"
  input: "InputPipline/strided_slice_2/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_3"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_3/stack"
  input: "InputPipline/strided_slice_3/stack_1"
  input: "InputPipline/strided_slice_3/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_1"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\005\004\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4/stack_2"
  op: "Const"
  device: "/device:CPU:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "InputPipline/strided_slice_4"
  op: "StridedSlice"
  input: "InputPipline/Reshape"
  input: "InputPipline/strided_slice_4/stack"
  input: "InputPipline/strided_slice_4/stack_1"
  input: "InputPipline/strided_slice_4/stack_2"
  device: "/device:CPU:*"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "InputPipline/Cast"
  op: "Cast"
  input: "InputPipline/strided_slice_4"
  device: "/device:CPU:*"
  attr {
    key: "DstT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "sub/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "\200\021\203\300\220\n\203\300\363\000\203\300\251\356\202\300o\345\202\300FO\203\300\216\010\204\300o\375\204\300UJ\206\300\210\330\207\300j\334\212\300\236[\215\300\020t\220\300\250v\225\300\024\216\233\300Q\302\243\300X\"\256\300\212\020\272\300;\260\304\300bM\316\300\357\216\324\300\345\273\330\300&d\333\300\373x\336\300\303\350\342\300\332\345\347\300\265\223\355\300?\323\361\300\367\255\365\300\\\375\370\300E\220\373\300]\223\375\3002\004\377\300>\270\376\300_\225\374\300\376\351\372\300\375\002\371\300\324\014\370\300\276\006\367\300_\034\367\300\303I\366\3007\326\365\300\210G\366\300t\267\366\300\217\241\366\300\213\222\366\300\336\274\366\300$\021\367\300b\036\370\300x\026\372\300\240!\374\300d\010\376\300\311\022\000\301v\326\000\301I;\001\301\202\254\001\301b\265\002\301\206\222\003\301\377|\004\301\360\247\005\301q\220\006\301\3034\007\301c0\010\301\220^\t\301\027\334\n\301u\350\014\301\232\356\016\301Q\200\021\301D\304\023\301\2552\026\301\204\366\030\301\260\253\033\301{\272\035\301}\324\037\301\242\027!\301\257\004\"\301#|\"\301X\270\"\301@X\"\301\020\025\"\301\206[\"\301\021\241\"\301\016\230\"\301~\t#\301Lb#\301\230\330#\301\206^$\301\245\256$\301\347\243$\301\261\352$\301\031k%\301\271i%\301G<%\301\204\006%\301\204\234$\301\367\216$\301\222\253$\301X\200$\301\356\221#\301f\271\"\301\253\027\"\301S\247!\301\256\314!\301X9\"\301\025\343!\301T\223!\301\253\267!\301X\260!\301s\324!\301\366\030\"\301dw\"\301\361\365\"\301\374\004#\301\246\224#\301\025\013$\301\317\343#\3013\373#\301\223\261#\301Be#\301\255\333\"\301\r*\"\301^B!\301[! \301\231\264\037\301rL\037\301\005\316\036\301\207(\036\301|i\035\301}\033\035\301v\225\034\301\035d\034\301|\031\034\30144\034\301\367:\034\301\313F\034\301\315_\034\301\361\302\034\301S\343\034\301\375\373\034\301\222 \035\301\220Q\035\301;\024\035\301.\243\034\301\221\312\034\301N\337\034\301NJ\035\301=p\035\301\\\236\035\301Q\343\035\301\365\214\036\301\365&\037\301\001\252 \301t\205!\301qC\"\301\235\347\"\301a\261#\301\200|$\301\362,%\301\344K&\301\206\361&\301\274Z\'\301\216\323\'\301\0000(\301\301R(\301\372\234(\301\336\353(\301j&)\301\307\255)\301<x*\301y\311*\301\374h+\301\037\024,\301\366\"-\301A+.\301\364\370.\301Ew/\301\363\0240\301_\3100\301;\2561\301\364\0012\301y\2072\301\032\0333\301\304\3033\301Q\2124\301.\2715\301/\2117\301\203\3708\3011\3738\301\353\3338\301C\2648\301Gl9\301\203\020:\3012\002;\301<\361;\301\223\256<\301C`=\301+\236=\301\276:<\301z\231:\3011\2679\301\333f9\301\016\3429\301Kq;\301\272\177=\301\367\272?\301\025\301@\301@\335@\301\367\253@\301W\361@\301i\374@\301_JA\301\240\200A\301@\362A\301R\217B\301\006&C\301\263\371C\301Z\263D\301\1770E\301\232rE\3018\263E\301.kE\301\200\021E\301\021\357D\301\221\322D\301n\217D\301u\030D\301\016\341C\301Q\322C\301\331\343C\301\265\365C\301\324\322C\301\320\272C\3014\255C\301\277\270C\301y\247C\301\325\205C\301vLC\301\376\007C\301Y\256B\301\007\273B\301\252\262B\301;\304B\301q\274B\301\321\267B\301\027\340B\301\005\300B\301)\354B\301\361\025C\301\366\034C\301o=C\301\300_C\301b\210C\301t\245C\301\265\221C\301\233\241C\301\257\242C\301\337\255C\301~\302C\301\026\333C\3010\305C\301-\322C\301L\031D\301\2475D\301\374\256D\301\354\\E\301\327\252E\301q\027E\301\007\377C\301\234\277A\3013\277>\301\027\010<\301D\3449\301\022\0368\301\014\3156\301\337\t7\301\351\'8\301\273\210:\301\0036=\301p\316>\301\330V@\301)\335B\301\205\316E\301\205\351F\301\367\374F\301e\204G\301\366=F\301m2B\301\213\310=\301v\353:\301\016@9\301\033\3308\301\021B9\3017T:\301\207\314<\301\225\241?\301\222\013B\301\023%C\301\300jC\301\331\373B\301\351%C\301\203\204C\301x\265C\301i\234D\301\204\316E\301\354?G\301\002\247G\301\231\265G\301BeG\301\265\035G\301\253\352F\301\205\262F\301\233\226F\301\035\274F\301\274\266F\301\245\273F\301\206\320F\301\255\352F\301*\035G\301\376\001G\301Q\375F\301%\242F\301\210\010F\301\365\275E\301\240\304E\301`\331E\301UCF\301\231,F\301{\204F\301\351\322F\301\033\304F\301\337\300F\301\252\306F\301\007\232F\301\271]F\301\035\215F\301\320\221F\301\317\254F\301f\255F\301\201\271F\301\032\251F\301c\235F\301\225\327F\301\025\004G\301j\374F\301\212\373F\301>\204F\301m\232F\301\331kF\301\2410F\301\t\tF\301\001\242E\301\005\220E\301\233\301E\301\223;F\301\364\323F\301\315\024G\301\365\202F\301\2112E\3018\033C\301%\232?\301\343\310;\301B\0219\301#\3416\301`X5\301\356\3574\301X\2175\301\235\2517\301\207\260:\301\004\204=\301\325\275?\301J\214B\301\371\220E\301\204vF\301\230\247D\301\337\334B\301o\036A\301\255\202=\301C\3458\301t\2115\301\274\0144\301^.4\301AG5\3016\2776\301yW9\301C\000=\301o\242@\3010eC\301\022IE\301\256\345F\301>\270G\301\274\343G\301\027\313G\301\326\224G\301\277\177G\301\372\215G\301\226pG\301j\352F\301$JF\301<\215E\301;\037E\301\231\357D\301R\375D\301\204UE\301j,F\301\247\036G\301 \227G\301M\256G\301\254\243G\301\273dG\301\346OG\301\211YG\301\237XG\301i#G\301]\367F\3018\341F\301\037\347F\301i\033G\301NCG\301k\'G\301G*G\301{\373F\301\'\336F\301H\264F\3012\305F\301\352\275F\301p\316F\3019\373F\301#\216G\301{\267G\301(\310G\301n\345G\301$\270G\3017\231G\301{|G\301x\221G\301\200wG\301\364\221G\301\306kG\301\363ZG\301U\022G\301\222FG\301\360nG\301\247nG\301=bG\301&{G\301\364\354F\301D\010F\301Q\336D\301\340\276C\301\024cB\301\005\315@\301 f?\301\256\005?\301\300\367>\301rs?\3016\214@\301\321\262B\301\353\375D\301*\377F\301V_G\301StG\301=\251G\301#\273G\3017\245G\301\376WG\301\273BG\301\375\306F\301r\030E\3012\343B\301\242\367@\301m\014@\301\205`?\301\224T?\301\t}?\301\262\362@\301\217\256B\3018VD\301\226\252E\301\017\266F\301!5G\301\246UG\301u]G\301\273rG\301)dG\301\030\\G\301\210\230G\301\032\333G\301`\303G\301\222\253G\301\001wG\301\031\237G\301\344}G\301j|G\301T\246G\301\337\261G\301\276jG\301f\037G\301\r\340F\301\\MF\3013\036F\301\352\025F\301\2611F\301\373RF\301\307\274F\301\252FG\301c\246G\301\342\236G\301\260\217G\301\373NG\301\255\224G\3016bI\301;.L\301 rM\301"
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "InputPipline/strided_slice"
  input: "sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "truediv/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 513
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 513
          }
        }
        tensor_content: "\237kR@w\303T@@oY@\336\t]@d\021Y@$\246T@Q\320a@\226\002d@\307\316l@\036\255o@\272St@t\020w@\006\302x@d\273\200@\206\373\206@e\204\214@X\201\223@Tt\235@.X\244@l2\252@\336|\255@\211\227\257@0\220\257@T\n\260@\214d\262@\340\343\265@\306r\272@\271\025\275@\222\352\277@\276\357\302@\376x\305@jr\307@q\331\310@\240\226\311@\271\021\312@;\272\313@pr\314@+Q\316@\267\\\317@~\317\317@\353\320\316@\254Y\315@IZ\314@\326\307\312@\350\261\310@\256\316\307@\306\351\306@\216h\306@\005\341\306@3\352\307@8\323\311@R\253\313@:b\316@\026\311\320@\377\214\322@\007\331\324@p\032\330@3\347\332@2\242\335@R\246\340@Gz\342@-\375\342@\213\275\343@~\254\344@\227^\345@\207\036\347@\037\374\350@\007\t\354@?\260\356@\240A\362@\351\323\366@\251\220\373@\211\364\377@\302c\002A\322\336\003A\324\035\005AV\321\005AIE\006A\313F\006A\330\021\006A\335\213\006A9B\007A\227\221\007A\351=\010A\310\321\010A-S\tA-+\nAZ\260\nA\321:\013A\361\346\013A\"\366\014Auo\rA\372\317\rA\3322\016A5n\016A\362\366\016A\254m\017A\024\234\017A\254\301\016A\205\246\rA\360\241\014A\201\313\013A\034\217\013A\220\246\013A\315,\013A\001\310\nA\\\314\nAl\276\nA\342\261\nA\235\304\nA\221\007\013AS,\013AI\276\nAY\272\nAU\216\nA\203\357\tA\350\231\tA\324\332\010A\327J\010A\312\205\007A\221\303\006A\203\365\005AE\030\005A3)\005AN1\005As[\005AbA\005AM\027\005AhZ\005A\017\177\005A\327\261\005A\225\220\005Af\303\005AQ\321\005A\314\342\005A\307\371\005AF5\006A\314\027\006A\356\005\006A\312\340\005Ag\252\005A\026\006\005A\004\030\004A\352\331\003AGE\003A\355\331\002A\222 \002A\177>\001A]\211\000A\310)\000A\200\206\377@\371G\000A\321\264\377@\360U\377@|\237\376@\2564\376@i\315\375@\212I\375@\313h\375@\320\260\374@\313\227\373@\210g\373@\222=\373@\270P\372@<\235\371@\345@\371@\031\345\370@\263\023\371@\377\334\371@\"6\372@{\023\373@\351\246\373@<?\375@yz\376@\223\177\377@5r\377@\220q\377@\016\326\377@\333,\000A\301\253\377@\316\033\000A\257K\000A\265\225\000A\025\021\001A6:\002Ay\302\003AB\333\004Al+\004A\261\333\002AK,\001A\216N\000A\214j\376@f\305\374@-v\373@\357\222\371@\365\331\367@#\245\365@\267\000\360@\017\223\351@\177#\345@Ml\341@\223\256\336@\354\223\336@\330\021\337@?\215\340@\n\004\340@\3747\336@\024M\334@\000\377\333@P$\333@Y\200\333@l\261\333@%\241\334@\022\335\335@\223J\337@\274\306\340@\271D\342@&;\343@\350\215\343@\r%\344@j\257\343@\251\021\343@\265\356\342@a\351\342@\345j\342@\010\215\341@\252=\341@\327\200\341@\212\200\341@\265\212\341@\302=\341@$0\341@\021\021\341@F<\341@\233a\341@\362\004\341@y\267\340@\271\201\340@J\254\337@\336\255\337@B\010\337@\316\033\337@\200\310\336@\r\244\336@j\020\337@\034\261\336@\323\025\337@\347A\337@[~\337@\337\276\337@\206\"\340@I\223\340@\357\310\340@Bm\340@\371k\340@=s\340@\343\205\340@\033\303\340@\353\361\340@\220\311\340@\237\022\341@\'\277\341@\216\352\341@\305\207\342@h\327\343@\310a\344@\007\025\343@\314\350\340@\"D\334@ZW\326@9\371\320@\321\237\314@l@\311@>\267\306@yO\307@f\206\311@V\260\316@\031 \324@\262\311\327@\036Q\333@\310Z\340@\241[\346@Sh\350@\030\037\350@\232\353\350@\342\316\345@\336l\335@\013l\324@\306t\316@X\274\312@?\002\312@\003\302\312@[\274\314@\303\330\321@\037q\327@,~\334@\342\342\336@\277I\337@]x\336@\334\353\336@y\273\337@\2629\340@O\356\341@\2248\344@(\334\346@E^\347@\333=\347@,\305\346@\r?\346@%\242\345@\037\001\345@\305\324\344@\3131\345@\237\344\344@\355\306\344@\361\035\345@\336?\345@4\324\345@\331\236\345@P\232\345@B\017\345@\245\331\343@8R\343@\\\317\343@\037\330\343@\t\252\344@\242b\344@;,\345@\245\304\345@{l\345@hR\345@\256\341\344@\333k\344@x\357\343@fL\344@\212N\344@\346h\344@\030\210\344@\376\230\344@nr\344@\331\213\344@I\007\345@\364w\345@\233I\345@\274\221\345@M\215\344@\211\325\344@\316s\344@\200\372\343@\001\245\343@\347\304\342@/\226\342@s\270\342@Bw\343@\004\302\344@\264\026\345@\244\t\344@\034o\341@\376 \335@\316H\326@\333\310\316@_)\311@\022\370\304@\033\020\302@\004u\301@\301\321\302@p(\307@!\034\315@d\362\322@\261\312\327@\351\232\335@\236\003\344@\353\352\345@_\316\341@\336\363\335@\257\017\332@ E\322@\216\236\310@.\236\301@\013|\276@1\234\276@\300\334\300@!\227\303@!\321\310@I\346\317@CX\327@\033\351\334@\r\322\340@X\030\344@\340\260\345@q\"\346@\315\034\346@L\215\345@\2778\345@\221 \345@\r,\345@A\027\344@i\321\342@Tm\341@\353>\340@\345\360\337@\353\013\340@\371\223\340@\206s\342@;3\344@I\023\345@u.\345@~\014\345@\217\244\344@\265\234\344@Y\256\344@\353\262\344@D\177\344@\231\006\344@\037\347\343@\317\331\343@\235s\344@\255\262\344@\374q\344@Sh\344@\275\366\343@N\270\343@\177S\343@\030\221\343@\224\233\343@\360\004\344@r\216\344@6\315\345@\210!\346@pq\346@\344\223\346@\375\355\345@\336\237\345@K\221\345@6\330\345@\351\201\345@\374\270\345@Gm\345@WJ\345@:\321\344@\373_\345@\206\250\345@\nH\345@\r\001\345@\200\030\345@d\027\344@\240o\342@\311\004\340@\036\251\335@\005\345\332@$\350\327@\003&\325@<e\324@\352\005\324@\331\306\324@b\372\326@\336 \333@\234\342\337@\324\306\343@\217{\344@\301\346\344@dS\345@z`\345@\023\032\345@\022\205\344@0j\344@\226O\343@l\372\337@\246\350\333@!\346\327@,)\326@\021\022\325@\'\265\324@\244 \325@\320\020\330@\221Q\333@\363\305\336@\237S\341@\316c\343@]]\344@\375\304\344@.\315\344@\251\013\345@\006\013\345@\256\312\344@\225i\345@a\326\345@\034\260\345@\221J\345@\003\346\344@V\021\345@\002\236\344@~d\344@O\377\344@\330X\345@\272\271\344@\251,\344@\300\231\343@\233`\342@\255+\342@[\355\341@\252\032\342@\343\363\341@^\236\342@\202K\343@\313\311\343@\211\250\343@U\332\343@R\340\343@\223}\345@\236\035\352@\275u\360@+C\363@"
      }
    }
  }
}
node {
  name: "truediv"
  op: "RealDiv"
  input: "sub"
  input: "truediv/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum"
  op: "Minimum"
  input: "truediv"
  input: "clip_by_value/Minimum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "clip_by_value/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "clip_by_value"
  op: "Maximum"
  input: "clip_by_value/Minimum"
  input: "clip_by_value/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "clip_by_value"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "sub_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "sub_1"
  op: "Sub"
  input: "mul"
  input: "sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims"
  op: "ExpandDims"
  input: "sub_1"
  input: "NH_to_NHWC/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "NH_to_NHWC/ExpandDims_1"
  op: "ExpandDims"
  input: "NH_to_NHWC/ExpandDims"
  input: "NH_to_NHWC/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 513
          }
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Shape"
  op: "Shape"
  input: "NH_to_NHWC/ExpandDims_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice"
  op: "StridedSlice"
  input: "Shape"
  input: "strided_slice/stack"
  input: "strided_slice/stack_1"
  input: "strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "ones/shape"
  op: "Pack"
  input: "strided_slice"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "ones/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "ones"
  op: "Fill"
  input: "ones/shape"
  input: "ones/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "mul_1"
  op: "Mul"
  input: "Placeholder"
  input: "ones"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "y_embedding/y_emb/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@y_embedding/y_emb"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
